<a href="https://colab.research.google.com/github/rabbitew/ai-practice/blob/main/Pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
data = {'name' : ['Beomwoo','Beomwoo','Beomwoo','Kim', 'Park'],
        'year' : [2013, 2014, 2015, 2016, 2015],
        'points' : [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [ ]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df.columns

Index(['name', 'year', 'points'], dtype='object')

In [ ]:
df.values

array([['Beomwoo', 2013, 1.5],
       ['Beomwoo', 2014, 1.7],
       ['Beomwoo', 2015, 3.6],
       ['Kim', 2016, 2.4],
       ['Park', 2015, 2.9]], dtype=object)

In [ ]:
df2 = pd.DataFrame(data, columns=['year', 'name', 'points', 'penalty'],
                   index = ['one', 'two', 'three', 'four', 'five'])
df2

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [ ]:
df2.describe()

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

In [ ]:
df['year']

0    2013
1    2014
2    2015
3    2016
4    2015
Name: year, dtype: int64

In [ ]:
df[['year', 'points']]

   year  points
0  2013     1.5
1  2014     1.7
2  2015     3.6
3  2016     2.4
4  2015     2.9

In [ ]:
df['penalty'] = 0.5

In [ ]:
import seaborn as sns  
titanic=sns.load_dataset('titanic')
titanic.head(3)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True

[3 rows x 15 columns]

In [ ]:
pclass = titanic.loc[:,'pclass']
pclass

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: pclass, Length: 891, dtype: int64

In [ ]:
fare = titanic.loc[:,'fare']
fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

In [ ]:
df = pd.DataFrame(pclass, fare)
df

         pclass
fare
7.2500      NaN
71.2833     NaN
7.9250      NaN
53.1000     NaN
8.0500      NaN
...         ...
13.0000     3.0
30.0000     1.0
23.4500     NaN
30.0000     1.0
7.7500      NaN

[891 rows x 1 columns]